[
    {
      "codename": "OMLETA_DE_MIEZUL_NOPTII",
      "classification": "DOAR PENTRU AGENȚI SECREȚI",
      "risk": "Aromă puternică ce poate trăda poziția agentului.",
      "cookingTimeMinutes": 7,
      "description": "O misiune de infiltrare culinară în zorii zilei, folosind un amestec pufos și discret de ouă și brânză.",
      "equipment": [
        "3 ouă",
        "2 linguri lapte",
        "Sare și piper",
        "O mână de brânză rasă",
        "1 lingură unt"
      ],
      "steps": [
        "Infiltrează zona tigăii: topește untul în liniște la foc mediu.",
        "Activează încărcătura: bate ouăle cu lapte, sare și piper, apoi toarnă în tigaie.",
        "Protocolul brânză: presară brânza și pliază omleta cu precizie.",
        "Evacuare fără urmă: glisează omleta în farfurie și retrage-te imediat."
      ],
      "blacklist": []
    },
    {
      "codename": "SMOOTHIE_INGHETAT",
      "classification": "DOAR PENTRU AGENȚI SECREȚI",
      "risk": "Activarea blenderului poate alerta forțele ostile din proximitate.",
      "cookingTimeMinutes": 4,
      "description": "O băutură tactică ultrarapidă pentru agenți aflați în deplasare, special concepută pentru reîncărcare instantă.",
      "equipment": [
        "1 cană fructe de pădure congelate",
        "1 banană",
        "1 cană iaurt sau lapte",
        "1 lingură miere",
        "Semințe de chia (opțional)"
      ],
      "steps": [
        "Achiziția activelor: introdu toate ingredientele în blender.",
        "Neutralizare la viteză mare: mixează până nu mai rămân fragmente identificabile.",
        "Livrarea încărcăturii: toarnă în pahar și consumă în deplină discreție."
      ],
      "blacklist": []
    },
    {
      "codename": "TOAST_UMBRA",
      "classification": "DOAR PENTRU AGENȚI SECREȚI",
      "risk": "Mirosul de toast poate compromite operațiunea dacă ventilația este slabă.",
      "cookingTimeMinutes": 3,
      "description": "Rația rapidă și silențioasă a agenților sub acoperire profundă.",
      "equipment": [
        "2 felii pâine",
        "2 linguri unt de arahide",
        "1 lingură gem",
        "Felii de banană (opțional)"
      ],
      "steps": [
        "Manipulare termică discretă: prăjește pâinea în tăcere.",
        "Criptare în două straturi: întinde untul de arahide, apoi gemul.",
        "Asamblare sub acoperire: adaugă banană dacă este necesar și consumă fără martori."
      ],
      "blacklist": []
    },
    {
      "codename": "ZIDUL_DE_PASTA",
      "classification": "DOAR PENTRU AGENȚI SECREȚI",
      "risk": "Emanarea de usturoi poate atrage atenția inamică sau diplomatică.",
      "cookingTimeMinutes": 18,
      "description": "Construiește un scut carbohidrat strategic pentru a susține operațiuni prelungite.",
      "equipment": [
        "200g paste",
        "2 căței usturoi",
        "Ulei de măsline",
        "Fulgi de chili",
        "Parmezan",
        "Sare"
      ],
      "steps": [
        "Străpunge pragul de fierbere: gătește pastele până la al dente.",
        "Operațiunea Usturoi: călește usturoiul în ulei de măsline.",
        "Construcția zidului: unește pastele cu uleiul aromat și fulgii de chili.",
        "Camuflaj final: pudrează cu parmezan și servește doar aliaților de încredere."
      ],
      "blacklist": []
    },
    {
      "codename": "PRAJITURA_IN_CANA_STEALTH",
      "classification": "DOAR PENTRU AGENȚI SECREȚI",
      "risk": "Supraîncălzirea poate provoca detonarea încărcăturii din cană.",
      "cookingTimeMinutes": 6,
      "description": "O misiune dulce, cu explozie controlată, pregătită în câteva secunde pentru operațiuni nocturne.",
      "equipment": [
        "4 linguri făină",
        "3 linguri zahăr",
        "2 linguri cacao",
        "3 linguri lapte",
        "2 linguri unt topit",
        "1 praf de copt",
        "Fulgi de ciocolată (opțional)"
      ],
      "steps": [
        "Protocol de amestecare: combină ingredientele direct în cană.",
        "Inițiere microonde: încălzește până când compoziția se ridică.",
        "Verificare termică: asigură-te că interiorul rămâne moale și confidențial.",
        "Extracție rapidă: consumă înainte ca senzorii inamici să capteze mirosul."
      ],
      "blacklist": []
    },
    {
      "codename": "RISOTTO_NOIR",
      "classification": "DOAR PENTRU AGENȚI SECREȚI — NIVEL OMEGA",
      "risk": "Operațiune lungă și sensibilă. Neatenția duce la risotto cimentat.",
      "cookingTimeMinutes": 42,
      "description": "Una dintre cele mai delicate misiuni culinare. Obiectivul: un risotto atât de fin încât destabilizează moralul oricărui adversar.",
      "equipment": [
        "300g orez Arborio",
        "1L supă fierbinte",
        "1 ceapă mică",
        "2 căței usturoi",
        "200ml vin alb",
        "50g unt",
        "50g parmezan ras",
        "Ulei de măsline",
        "Sare și piper",
        "Tigaie de operațiuni speciale"
      ],
      "steps": [
        "Activează baza de comandă: încălzește supa la foc mic pentru alimentare constantă.",
        "Infiltrează ceapa în tigaie cu puțin ulei până devine translucidă.",
        "Adaugă usturoiul și lasă-l câteva secunde — informațiile lui sunt volatile.",
        "Adaugă orezul Arborio și amestecă până devine ușor sticlos.",
        "Deglazează zona cu vin alb și urmărește evaporarea completă.",
        "Adaugă prima tranșă de supă fierbinte pentru inițierea operațiunii.",
        "Amestecă fără oprire — consistența depinde de tine.",
        "Adaugă treptat supă pe măsură ce lichidul este absorbit.",
        "Monitorizează atent — orice pauză poate compromite textura.",
        "Repetă procesul până când orezul este cremos și al dente.",
        "Retrage de pe foc și adaugă untul până se topește uniform.",
        "Încorporează parmezanul pentru blindaj final.",
        "Condimentează strategic cu sare și piper.",
        "Lasă preparatul să se odihnească 1 minut și servește imediat."
      ],
      "blacklist": []
    }
  ]
  